{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "calling",
    "1": "clapping",
    "2": "cycling",
    "3": "dancing",
    "4": "drinking",
    "5": "eating",
    "6": "fighting",
    "7": "hugging",
    "8": "laughing",
    "9": "listening_to_music",
    "10": "running",
    "11": "sitting",
    "12": "sleeping",
    "13": "texting",
    "14": "using_laptop"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "calling": 0,
    "clapping": 1,
    "cycling": 2,
    "dancing": 3,
    "drinking": 4,
    "eating": 5,
    "fighting": 6,
    "hugging": 7,
    "laughing": 8,
    "listening_to_music": 9,
    "running": 10,
    "sitting": 11,
    "sleeping": 12,
    "texting": 13,
    "using_laptop": 14
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.2"
}
